dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l162xd_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32L162xD_gpio_v1_0_Modes.xml*/

#if !defined(_STM32L162xD_PINMUX_H_)
# define _STM32L162xD_PINMUX_H_

#define FSMC_A0_FUNC             0
#define FSMC_A1_FUNC             1
#define FSMC_A10_FUNC            2
#define FSMC_A11_FUNC            3
#define FSMC_A12_FUNC            4
#define FSMC_A13_FUNC            5
#define FSMC_A14_FUNC            6
#define FSMC_A15_FUNC            7
#define FSMC_A16_FUNC            8
#define FSMC_A17_FUNC            9
#define FSMC_A18_FUNC            10
#define FSMC_A19_FUNC            11
#define FSMC_A2_FUNC             12
#define FSMC_A20_FUNC            13
#define FSMC_A21_FUNC            14
#define FSMC_A22_FUNC            15
#define FSMC_A23_FUNC            16
#define FSMC_A24_FUNC            17
#define FSMC_A25_FUNC            18
#define FSMC_A3_FUNC             19
#define FSMC_A4_FUNC             20
#define FSMC_A5_FUNC             21
#define FSMC_A6_FUNC             22
#define FSMC_A7_FUNC             23
#define FSMC_A8_FUNC             24
#define FSMC_A9_FUNC             25
#define FSMC_CLK_FUNC            26
#define FSMC_D0_FUNC             27
#define FSMC_D1_FUNC             28
#define FSMC_D10_FUNC            29
#define FSMC_D11_FUNC            30
#define FSMC_D12_FUNC            31
#define FSMC_D13_FUNC            32
#define FSMC_D14_FUNC            33
#define FSMC_D15_FUNC            34
#define FSMC_D2_FUNC             35
#define FSMC_D3_FUNC             36
#define FSMC_D4_FUNC             37
#define FSMC_D5_FUNC             38
#define FSMC_D6_FUNC             39
#define FSMC_D7_FUNC             40
#define FSMC_D8_FUNC             41
#define FSMC_D9_FUNC             42
#define FSMC_DA0_FUNC            43
#define FSMC_DA1_FUNC            44
#define FSMC_DA10_FUNC           45
#define FSMC_DA11_FUNC           46
#define FSMC_DA12_FUNC           47
#define FSMC_DA13_FUNC           48
#define FSMC_DA14_FUNC           49
#define FSMC_DA15_FUNC           50
#define FSMC_DA2_FUNC            51
#define FSMC_DA3_FUNC            52
#define FSMC_DA4_FUNC            53
#define FSMC_DA5_FUNC            54
#define FSMC_DA6_FUNC            55
#define FSMC_DA7_FUNC            56
#define FSMC_DA8_FUNC            57
#define FSMC_DA9_FUNC            58
#define FSMC_NBL0_FUNC           59
#define FSMC_NBL1_FUNC           60
#define FSMC_NE1_FUNC            61
#define FSMC_NE2_FUNC            62
#define FSMC_NE3_FUNC            63
#define FSMC_NE4_FUNC            64
#define FSMC_NL_FUNC             65
#define FSMC_NOE_FUNC            66
#define FSMC_NWAIT_FUNC          67
#define FSMC_NWE_FUNC            68
#define I2C1_SCL_FUNC            69
#define I2C1_SDA_FUNC            70
#define I2C1_SMBA_FUNC           71
#define I2C2_SCL_FUNC            72
#define I2C2_SDA_FUNC            73
#define I2C2_SMBA_FUNC           74
#define I2S2_CK_FUNC             75
#define I2S2_MCK_FUNC            76
#define I2S2_SD_FUNC             77
#define I2S2_WS_FUNC             78
#define I2S3_CK_FUNC             79
#define I2S3_MCK_FUNC            80
#define I2S3_SD_FUNC             81
#define I2S3_WS_FUNC             82
#define LCD_COM0_FUNC            83
#define LCD_COM1_FUNC            84
#define LCD_COM2_FUNC            85
#define LCD_COM3_FUNC            86
#define LCD_COM4_FUNC            87
#define LCD_COM5_FUNC            88
#define LCD_COM6_FUNC            89
#define LCD_COM7_FUNC            90
#define LCD_SEG0_FUNC            91
#define LCD_SEG1_FUNC            92
#define LCD_SEG10_FUNC           93
#define LCD_SEG11_FUNC           94
#define LCD_SEG12_FUNC           95
#define LCD_SEG13_FUNC           96
#define LCD_SEG14_FUNC           97
#define LCD_SEG15_FUNC           98
#define LCD_SEG16_FUNC           99
#define LCD_SEG17_FUNC           100
#define LCD_SEG18_FUNC           101
#define LCD_SEG19_FUNC           102
#define LCD_SEG2_FUNC            103
#define LCD_SEG20_FUNC           104
#define LCD_SEG21_FUNC           105
#define LCD_SEG22_FUNC           106
#define LCD_SEG23_FUNC           107
#define LCD_SEG24_FUNC           108
#define LCD_SEG25_FUNC           109
#define LCD_SEG26_FUNC           110
#define LCD_SEG27_FUNC           111
#define LCD_SEG28_FUNC           112
#define LCD_SEG29_FUNC           113
#define LCD_SEG3_FUNC            114
#define LCD_SEG30_FUNC           115
#define LCD_SEG31_FUNC           116
#define LCD_SEG32_FUNC           117
#define LCD_SEG33_FUNC           118
#define LCD_SEG34_FUNC           119
#define LCD_SEG35_FUNC           120
#define LCD_SEG36_FUNC           121
#define LCD_SEG37_FUNC           122
#define LCD_SEG38_FUNC           123
#define LCD_SEG39_FUNC           124
#define LCD_SEG4_FUNC            125
#define LCD_SEG40_FUNC           126
#define LCD_SEG41_FUNC           127
#define LCD_SEG42_FUNC           128
#define LCD_SEG43_FUNC           129
#define LCD_SEG5_FUNC            130
#define LCD_SEG6_FUNC            131
#define LCD_SEG7_FUNC            132
#define LCD_SEG8_FUNC            133
#define LCD_SEG9_FUNC            134
#define RCC_MCO_FUNC             135
#define RCC_OSC32_IN_FUNC        136
#define RCC_OSC32_OUT_FUNC       137
#define RCC_OSC_IN_FUNC          138
#define RCC_OSC_OUT_FUNC         139
#define RTC_OUT_ALARM_FUNC       140
#define RTC_OUT_CALIB_FUNC       141
#define RTC_REFIN_FUNC           142
#define RTC_TAMP1_FUNC           143
#define RTC_TAMP2_FUNC           144
#define RTC_TAMP3_FUNC           145
#define RTC_TS_FUNC              146
#define SDIO_CK_FUNC             147
#define SDIO_CMD_FUNC            148
#define SDIO_D0_FUNC             149
#define SDIO_D1_FUNC             150
#define SDIO_D2_FUNC             151
#define SDIO_D3_FUNC             152
#define SDIO_D4_FUNC             153
#define SDIO_D5_FUNC             154
#define SDIO_D6_FUNC             155
#define SDIO_D7_FUNC             156
#define SPI1_MISO_FUNC           157
#define SPI1_MOSI_FUNC           158
#define SPI1_NSS_FUNC            159
#define SPI1_SCK_FUNC            160
#define SPI2_MISO_FUNC           161
#define SPI2_MOSI_FUNC           162
#define SPI2_NSS_FUNC            163
#define SPI2_SCK_FUNC            164
#define SPI3_MISO_FUNC           165
#define SPI3_MOSI_FUNC           166
#define SPI3_NSS_FUNC            167
#define SPI3_SCK_FUNC            168
#define SYS_JTCK_SWCLK_FUNC      169
#define SYS_JTDI_FUNC            170
#define SYS_JTDO_TRACESWO_FUNC   171
#define SYS_JTMS_SWDIO_FUNC      172
#define SYS_JTRST_FUNC           173
#define SYS_TRACECK_FUNC         174
#define SYS_TRACED0_FUNC         175
#define SYS_TRACED1_FUNC         176
#define SYS_TRACED2_FUNC         177
#define SYS_TRACED3_FUNC         178
#define SYS_WKUP1_FUNC           179
#define SYS_WKUP2_FUNC           180
#define SYS_WKUP3_FUNC           181
#define TIM10_CH1_FUNC           182
#define TIM11_CH1_FUNC           183
#define TIM2_CH1_FUNC            184
#define TIM2_CH2_FUNC            185
#define TIM2_CH3_FUNC            186
#define TIM2_CH4_FUNC            187
#define TIM3_CH1_FUNC            188
#define TIM3_CH2_FUNC            189
#define TIM3_CH3_FUNC            190
#define TIM3_CH4_FUNC            191
#define TIM3_ETR_FUNC            192
#define TIM4_CH1_FUNC            193
#define TIM4_CH2_FUNC            194
#define TIM4_CH3_FUNC            195
#define TIM4_CH4_FUNC            196
#define TIM4_ETR_FUNC            197
#define TIM5_CH1_FUNC            198
#define TIM5_CH2_FUNC            199
#define TIM5_CH3_FUNC            200
#define TIM5_CH4_FUNC            201
#define TIM5_ETR_FUNC            202
#define TIM9_CH1_FUNC            203
#define TIM9_CH2_FUNC            204
#define TIMX_IC1_FUNC            205
#define TIMX_IC2_FUNC            206
#define TIMX_IC3_FUNC            207
#define TIMX_IC4_FUNC            208
#define TS_G10_IO1_FUNC          209
#define TS_G10_IO2_FUNC          210
#define TS_G10_IO3_FUNC          211
#define TS_G10_IO4_FUNC          212
#define TS_G11_IO1_FUNC          213
#define TS_G11_IO2_FUNC          214
#define TS_G11_IO3_FUNC          215
#define TS_G11_IO4_FUNC          216
#define TS_G11_IO5_FUNC          217
#define TS_G1_IO1_FUNC           218
#define TS_G1_IO2_FUNC           219
#define TS_G1_IO3_FUNC           220
#define TS_G1_IO4_FUNC           221
#define TS_G2_IO1_FUNC           222
#define TS_G2_IO2_FUNC           223
#define TS_G2_IO3_FUNC           224
#define TS_G2_IO4_FUNC           225
#define TS_G2_IO5_FUNC           226
#define TS_G3_IO1_FUNC           227
#define TS_G3_IO2_FUNC           228
#define TS_G3_IO3_FUNC           229
#define TS_G3_IO4_FUNC           230
#define TS_G3_IO5_FUNC           231
#define TS_G4_IO1_FUNC           232
#define TS_G4_IO2_FUNC           233
#define TS_G4_IO3_FUNC           234
#define TS_G5_IO1_FUNC           235
#define TS_G5_IO2_FUNC           236
#define TS_G5_IO3_FUNC           237
#define TS_G6_IO1_FUNC           238
#define TS_G6_IO2_FUNC           239
#define TS_G6_IO3_FUNC           240
#define TS_G6_IO4_FUNC           241
#define TS_G7_IO1_FUNC           242
#define TS_G7_IO2_FUNC           243
#define TS_G7_IO3_FUNC           244
#define TS_G7_IO4_FUNC           245
#define TS_G7_IO5_FUNC           246
#define TS_G7_IO6_FUNC           247
#define TS_G7_IO7_FUNC           248
#define TS_G8_IO1_FUNC           249
#define TS_G8_IO2_FUNC           250
#define TS_G8_IO3_FUNC           251
#define TS_G8_IO4_FUNC           252
#define TS_G9_IO1_FUNC           253
#define TS_G9_IO2_FUNC           254
#define TS_G9_IO3_FUNC           255
#define TS_G9_IO4_FUNC           256
#define UART4_RX_FUNC            257
#define UART4_TX_FUNC            258
#define UART5_RX_FUNC            259
#define UART5_TX_FUNC            260
#define USART1_CK_FUNC           261
#define UART1_CK_FUNC            261
#define USART1_CTS_FUNC          262
#define UART1_CTS_FUNC           262
#define USART1_RTS_FUNC          263
#define UART1_RTS_FUNC           263
#define USART1_RX_FUNC           264
#define UART1_RX_FUNC            264
#define USART1_TX_FUNC           265
#define UART1_TX_FUNC            265
#define USART2_CK_FUNC           266
#define UART2_CK_FUNC            266
#define USART2_CTS_FUNC          267
#define UART2_CTS_FUNC           267
#define USART2_RTS_FUNC          268
#define UART2_RTS_FUNC           268
#define USART2_RX_FUNC           269
#define UART2_RX_FUNC            269
#define USART2_TX_FUNC           270
#define UART2_TX_FUNC            270
#define USART3_CK_FUNC           271
#define UART3_CK_FUNC            271
#define USART3_CTS_FUNC          272
#define UART3_CTS_FUNC           272
#define USART3_RTS_FUNC          273
#define UART3_RTS_FUNC           273
#define USART3_RX_FUNC           274
#define UART3_RX_FUNC            274
#define USART3_TX_FUNC           275
#define UART3_TX_FUNC            275
#define USB_DM_FUNC              276
#define USB_DP_FUNC              277

