dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32l162xd_pinmux.h
	((gpio == PE12) && (func == FSMC_DA9_FUNC            )) ? 12 : \
	((gpio == PE12) && (func == TIMX_IC1_FUNC            )) ? 14 : \
	((gpio == PE13) && (func == SPI1_SCK_FUNC            )) ?  5 : \
	((gpio == PE13) && (func == FSMC_D10_FUNC            )) ? 12 : \
	((gpio == PE13) && (func == FSMC_DA10_FUNC           )) ? 12 : \
	((gpio == PE13) && (func == TIMX_IC2_FUNC            )) ? 14 : \
	((gpio == PE14) && (func == SPI1_MISO_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == FSMC_D11_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == FSMC_DA11_FUNC           )) ? 12 : \
	((gpio == PE14) && (func == TIMX_IC3_FUNC            )) ? 14 : \
	((gpio == PE15) && (func == SPI1_MOSI_FUNC           )) ?  5 : \
	((gpio == PE15) && (func == FSMC_D12_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == FSMC_DA12_FUNC           )) ? 12 : \
	((gpio == PE15) && (func == TIMX_IC4_FUNC            )) ? 14 : \
	((gpio == PF00) && (func == FSMC_A0_FUNC             )) ? 12 : \
	((gpio == PF01) && (func == FSMC_A1_FUNC             )) ? 12 : \
	((gpio == PF02) && (func == FSMC_A2_FUNC             )) ? 12 : \
	((gpio == PF03) && (func == FSMC_A3_FUNC             )) ? 12 : \
	((gpio == PF04) && (func == FSMC_A4_FUNC             )) ? 12 : \
	((gpio == PF05) && (func == FSMC_A5_FUNC             )) ? 12 : \
	((gpio == PF06) && (func == TIM5_CH1_FUNC            )) ?  2 : \
	((gpio == PF06) && (func == TIM5_ETR_FUNC            )) ?  2 : \
	((gpio == PF06) && (func == TS_G11_IO1_FUNC          )) ? 14 : \
	((gpio == PF07) && (func == TIM5_CH2_FUNC            )) ?  2 : \
	((gpio == PF07) && (func == TS_G11_IO2_FUNC          )) ? 14 : \
	((gpio == PF08) && (func == TIM5_CH3_FUNC            )) ?  2 : \
	((gpio == PF08) && (func == TS_G11_IO3_FUNC          )) ? 14 : \
	((gpio == PF09) && (func == TIM5_CH4_FUNC            )) ?  2 : \
	((gpio == PF09) && (func == TS_G11_IO4_FUNC          )) ? 14 : \
	((gpio == PF10) && (func == TS_G11_IO5_FUNC          )) ? 14 : \
	((gpio == PF11) && (func == TS_G3_IO4_FUNC           )) ? 14 : \
	((gpio == PF12) && (func == FSMC_A6_FUNC             )) ? 12 : \
	((gpio == PF12) && (func == TS_G3_IO5_FUNC           )) ? 14 : \
	((gpio == PF13) && (func == FSMC_A7_FUNC             )) ? 12 : \
	((gpio == PF13) && (func == TS_G9_IO3_FUNC           )) ? 14 : \
	((gpio == PF14) && (func == FSMC_A8_FUNC             )) ? 12 : \
	((gpio == PF14) && (func == TS_G9_IO4_FUNC           )) ? 14 : \
	((gpio == PF15) && (func == FSMC_A9_FUNC             )) ? 12 : \
	((gpio == PF15) && (func == TS_G2_IO3_FUNC           )) ? 14 : \
	((gpio == PG00) && (func == FSMC_A10_FUNC            )) ? 12 : \
	((gpio == PG00) && (func == TS_G2_IO4_FUNC           )) ? 14 : \
	((gpio == PG01) && (func == FSMC_A11_FUNC            )) ? 12 : \
	((gpio == PG01) && (func == TS_G2_IO5_FUNC           )) ? 14 : \
	((gpio == PG02) && (func == FSMC_A12_FUNC            )) ? 12 : \
	((gpio == PG02) && (func == TS_G7_IO5_FUNC           )) ? 14 : \
	((gpio == PG03) && (func == FSMC_A13_FUNC            )) ? 12 : \
	((gpio == PG03) && (func == TS_G7_IO6_FUNC           )) ? 14 : \
	((gpio == PG04) && (func == FSMC_A14_FUNC            )) ? 12 : \
	((gpio == PG04) && (func == TS_G7_IO7_FUNC           )) ? 14 : \
	((gpio == PG05) && (func == FSMC_A15_FUNC            )) ? 12 : \
	((gpio == PG09) && (func == FSMC_NE2_FUNC            )) ? 12 : \
	((gpio == PG10) && (func == FSMC_NE3_FUNC            )) ? 12 : \
	((gpio == PG12) && (func == FSMC_NE4_FUNC            )) ? 12 : \
	((gpio == PG13) && (func == FSMC_A24_FUNC            )) ? 12 : \
	((gpio == PG14) && (func == FSMC_A25_FUNC            )) ? 12 : \
	((gpio == PH00) && (func == RCC_OSC_IN_FUNC          )) ?  0 : \
	((gpio == PH01) && (func == RCC_OSC_OUT_FUNC         )) ?  0 : \
	((gpio == PH02) && (func == FSMC_A22_FUNC            )) ? 12 : \
	AF_NO_SUCH_PINFUNC)

# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB08) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB09) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB12) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB13) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB14) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PB15) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PD00) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PD07) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE00) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE01) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE03) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PE04) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PE05) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE09) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PE10) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE11) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE12) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PF06) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PF07) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PF08) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PF09) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	AF_NO_SUCH_PINFUNC)
#endif
